artillery.yaml
config:
  target: http://localhost:3000
  phases:
    - duration: 30
      arrivalRate: 100
      rampTo: 600
      name: 'Warm up the Application'
    - duration: 90
      arrivalRate: 600
      name: "Sustained Max load"
  ensure:
    maxErrorRate: 100
scenarios:
  - flow:
      - get:
          url: "/products/40700"